app/controllers/projects_controller.rb

	def create
		@project = Project.new(project_params)

		if @project.save
---
INSERT INTO "projects" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Sublime Text 3"], ["description", "A text editor for everyone"], ["created_at", "2017-02-22 05:18:10.513489"], ["updated_at", "2017-02-22 05:18:10.513489"]]

	def show
		@project = Project.find(params[:id])
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", 1]]